//=============================================================================
//
// アイテムクラス(itemObj.h)
// Author : 唐﨑結斗
// 概要 : アイテム生成を行う
//
//=============================================================================
#ifndef _ITEMOBJ_H_			// このマクロ定義がされてなかったら
#define _ITEMOBJ_H_			// 二重インクルード防止のマクロ定義

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "objectX.h"

//=============================================================================
// モデルオブジェクトクラス
// Author : 唐﨑結斗
// 概要 : モデルオブジェクト生成を行うクラス
//=============================================================================
class CItemObj : public CObjectX
{
public:
	//--------------------------------------------------------------------
	// 静的メンバ関数
	//--------------------------------------------------------------------
	static CItemObj *Create();	// モデルオブジェクトの生成

	//--------------------------------------------------------------------
	// コンストラクタとデストラクタ
	//--------------------------------------------------------------------
	CItemObj();
	~CItemObj();

	//--------------------------------------------------------------------
	// メンバ関数
	//--------------------------------------------------------------------
	HRESULT Init(D3DXVECTOR3 pos) override;											// 初期化
	void Uninit() override;															// 終了
	void Update() override;															// 更新
	void Draw() override;															// 描画
	void SetParent(CModel3D *pParent) { m_pParent = pParent; }						// 親の設定
	void SetParent() { m_pParent = nullptr; }										// 親の設定解除
	void SetPosOffset(D3DXVECTOR3 posOffset) { m_posOffset = posOffset; }			// 位置の差分の設定
	void SetRotOffset(D3DXVECTOR3 rotOffset) { m_rotOffset = rotOffset; }			// 向きの差分の設定

private:
	//--------------------------------------------------------------------
	// メンバ変数
	//--------------------------------------------------------------------
	CModel3D *m_pParent;			// 親モデルの情報
	D3DXVECTOR3 m_posOffset;		// 位置の差分
	D3DXVECTOR3 m_rotOffset;		// 向きの差分
};

#endif


