//===================================================
//
// メインヘッダー
// Author : Sato Teruto
//
//===================================================
#ifndef _MAIN_H_
#define _MAIN_H_	//二重インクルード防止

//*****************************************************************************
// ライブラリーリンク
//*****************************************************************************
#pragma comment(lib,"ws2_32.lib")		// サーバーの処理に必要
#pragma comment(lib,"d3d9.lib")			// 描画処理に必要
#pragma comment(lib,"d3dx9.lib")		// [d3d9.lib]の拡張ライブラリ
#pragma comment(lib,"dxguid.lib")		// DirectXのコンポネート(部品)の使用に必要
#pragma comment(lib,"winmm.lib")		// システム時刻取得に必要
#pragma comment(lib,"xinput.lib")		// ジョイパッド入力に必要

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <Windows.h>
#include <tchar.h>							// _T
#include "d3dx9.h"							// 描画処理に必要
#include "xaudio2.h"						// サウンド処理に必要
#include "Xinput.h"							// ジョイパット処理に必要

#define _CRTDBG_MAP_ALLOC
#include <crtdbg.h>

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
//ウィンドウプロシージャ
LRESULT CALLBACK WndProc(HWND hWnd, UINT uMsg, WPARAM wParam, LPARAM lParam);

int GetFPS();	//FPSの取得

#endif // !_MAIN_H_