//===================================================
//
// メッセージを表示する処理
// Author : Sato Teruto
//
//===================================================

//----------------------------
// インクルード
//----------------------------
#include "message.h"

//==========================================
// コンストラクタ
//==========================================
CMessage::CMessage()
{
}

//==========================================
// デストラクタ
//==========================================
CMessage::~CMessage()
{
}

//==========================================
// 初期化
//==========================================
HRESULT CMessage::Init(D3DXVECTOR3 pos)
{
	CObject2D::Init(pos);
	CObject2D::SetTexture(CTexture::TEXTURE_FINISH);

	return S_OK;
}

//==========================================
// 終了
//==========================================
void CMessage::Uninit()
{
	CObject2D::Uninit();
}

//==========================================
// 更新
//==========================================
void CMessage::Update()
{
	CObject2D::Update();
}

//==========================================
// 描画
//==========================================
void CMessage::Draw()
{
	CObject2D::Draw();
}

//==========================================
// 生成
//==========================================
CMessage * CMessage::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CMessage *pMessage = nullptr;

	//----------------------------------
	// ポリゴンの生成と初期化
	//----------------------------------
	pMessage = new CMessage;	//生成

	if (pMessage != nullptr)
	{//NULLチェック
		//引数の代入
		pMessage->m_fWidth = fWidth;	//幅
		pMessage->m_fHeight = fHeight;	//高さ

		//初期化
		pMessage->Init(D3DXVECTOR3(pos));
	}

	return pMessage;
}
