//===================================================
//
// ステージ選択ヘッダー
// Author : Sato Teruto
//
//===================================================
#ifndef _STAGE_SELECT_H_
#define _STAGE_SELECT_H_	

//----------------------------------
// インクルード
//----------------------------------
#include <d3dx9.h>

//----------------------------------
// 前方宣言
//----------------------------------
class CCamera;		//カメラ
class CMeshField;	//メッシュフィールド(地面)

//==================================
// タイトルクラスの定義
//==================================
class CStageSelect
{
public:
	CStageSelect();		//コンストラクタ
	~CStageSelect();	//デストラクタ

	//-------------------------
	// メンバ関数
	//-------------------------
	HRESULT Init();
	void Uninit();
	void Update();

	//-------------------------
	// ゲッター
	//-------------------------
	CCamera* GetCamera() { return m_pCamera; }	//カメラを取得

private:
	//-------------------------
	// メンバ変数
	//-------------------------
	CCamera*	m_pCamera;		//カメラ
	CMeshField*	m_pMeshField;	//メッシュフィールド
};

#endif