//===================================================
//
// 便利な処理ヘッダー
// Author:Teruto Sato
//
//===================================================
#ifndef _UTILITY_H_
#define _UTILITY_H_	//二重インクルード防止

//--------------------------
// インクルード
//--------------------------
#include "object.h"

//================================
// ユーティリティクラスの定義
//================================
class CUtility
{
public:
	CUtility();		//コンストラクタ
	~CUtility();	//デストラクタ

	//-----------------------
	// 静的メンバ関数
	//-----------------------
	//角度の正規化
	static float GetNorRot(float rot);
};

#endif _UTILITY_H_